Repository: yeager/ddtp-translate
Catalog: po/*.po
Languages: sv

source: Submitted by {user}
sv: Inskickad av {user}

source: Reviews: {done}/{needed} ✓
sv: Granskningar: {done}/{needed} ✓

source: Reviews: {done}/{needed} (awaiting review)
sv: Granskningar: {done}/{needed} (inväntar granskning)

source: Preferences
sv: Inställningar

source: DDTSS Account
sv: DDTSS-konto

source: Create an account at https://ddtp.debian.org/ddtss/index.cgi/createlogin
sv: Skapa ett konto på https://ddtp.debian.org/ddtss/index.cgi/createlogin

source: Password
sv: Lösenord

source: Test Login
sv: Testa inloggning

source: Settings
sv: Inställningar

source: Display
sv: Visning

source: Limit how many packages are loaded into the list for faster startup.
sv: Begränsa antalet paket som läses in i listan för snabbare start.

source: Max packages to display
sv: Max antal paket att visa

source: All
sv: Alla

source: Logging
sv: Loggning

source: Enable event logging to track application activity.
sv: Aktivera händelseloggning för att spåra applikationsaktivitet.

source: Enable event logging
sv: Aktivera händelseloggning

source: Workflow
sv: Arbetsflöde

source: Customize the translation workflow.
sv: Anpassa arbetsflödet för översättning.

source: Auto-lint before submit
sv: Automatisk lint före inlämning

source: Auto-advance to next package after submit
sv: Automatisk övergång till nästa paket efter inlämning

source: Cache TTL (hours)
sv: Cache-TTL (timmar)

source: Sorting
sv: Sortering

source: Default sort order for the package list.
sv: Sorteringsordning som standard för paketlistan.

source: Default sort mode
sv: Sorteringsläge som standard

source: Alphabetical
sv: Alfabetiskt

source: By status
sv: Efter status

source: By popularity (popcon)
sv: Efter popularitet (popcon)

source: Fetch DDTSS statuses on load
sv: Hämta DDTSS-status vid inläsning

source: Enter alias and password first
sv: Ange alias och lösenord först

source: Login successful!
sv: Inloggningen lyckades!

source: DDTP Translate
sv: Översätt DDTP

source: Refresh
sv: Uppdatera

source: By popularity
sv: Efter popularitet

source: Sort mode
sv: Sorteringsläge

source: Sort direction
sv: Sorteringsriktning

source: All packages
sv: Alla paket

source: 🔵 Not translated
sv: 🔵 Inte översatt

source: 🟡 Submitted (not reviewed)
sv: 🟡 Inskickad (inte granskad)

source: 🟠 Reviewed (with comments)
sv: 🟠 Granskad (med kommentarer)

source: 🟢 Reviewed OK
sv: 🟢 Granskad OK

source: Filter by status
sv: Filtrera efter status

source: Toggle heatmap view
sv: Växla värmekarta

source: Show Queue
sv: Visa kö

source: Review translations
sv: Granska översättningar

source: Statistics
sv: Statistik

source: Lint translation
sv: Linta översättning

source: Import translated PO file
sv: Importera översatt PO-fil

source: Export as PO file
sv: Exportera som PO-fil

source: Export as PO file…
sv: Exportera som PO-fil…

source: Import translated PO…
sv: Importera översatt PO…

source: Submit Now
sv: Skicka nu

source: Add to Queue
sv: Lägg till i kö

source: Lint Translation
sv: Linta översättning

source: Next Package
sv: Nästa paket

source: Previous Package
sv: Föregående paket

source: Clear queue
sv: Töm kö

source: Keyboard Shortcuts
sv: Tangentbordsgenvägar

source: About
sv: Om

source: Translate
sv: Översätt

source: Review
sv: Granska

source: Filter packages…
sv: Filtrera paket…

source: Original (English)
sv: Original (engelska)

source: Copy source text
sv: Kopiera källtext

source: Translation
sv: Översättning

source: Paste translation
sv: Klistra in översättning

source: Auto-translate
sv: Översätt automatiskt

source: Translate using po-translate
sv: Översätt med po-translate

source: Add this translation to the send queue
sv: Lägg till denna översättning till sändningskön

source: Ready
sv: Redo

source: Pending Reviews
sv: Väntar på granskning

source: Refresh pending reviews
sv: Uppdatera väntar på granskning

source: Accept All
sv: Godkänn alla

source: Accept
sv: Godkänn

source: No pending reviews
sv: Inga väntande granskningar

source: Click refresh to check for translations awaiting review on DDTSS. Note: You cannot review your own translations.
sv: Klicka på uppdatera för att kontrollera om det finns översättningar som väntar på granskning på DDTSS. Observera: Du kan inte granska dina egna översättningar.

source: Original
sv: Ursprunglig

source: Reject
sv: Avvisa

source: Configure DDTSS credentials, display options, and workflow.
sv: Konfigurera autentiseringsuppgifter för DDTSS, visningsalternativ och arbetsflöde.

source: Open Settings
sv: Öppna inställningar

source: {untranslated} untranslated | {queue} in queue | {sent} submitted
sv: {untranslated} icke-översatta | {queue} i kö | {sent} inlämnade

source: logged in
sv: inloggad

source: not logged in
sv: inte inloggad

source: {s} seconds
sv: {s} sekunder

source: {m} minutes
sv: {m} minuter

source: {shown} of {total}
sv: {shown} av {total}

source: {n} packages
sv: {n} paket

source: Loading…
sv: Läser in…

source: Downloading package data…
sv: Hämtar ner paketdata…

source: {n} packages loaded
sv: {n} paket inlästa

source: Could not connect to DDTP servers. Check your internet connection and try again.
sv: Misslyckades med att ansluta till DDTP-servrarna. Kontrollera din internetanslutning och försök igen.

source: Failed to load packages: {error}
sv: Misslyckades med att läsa in paketen: {error}

source: DDTSS status fetch failed: {e}
sv: Hämtning av DDTSS-status misslyckades: {e}

source: Submitted ✅
sv: Inskickad ✅

source: Submission error ⚠️
sv: Fel vid inlämning ⚠️

source: In queue 📬
sv: I kö 📬

source: Modified — not in queue 📝
sv: Ändrad — inte i kö 📝

source: Reviewed OK ✅
sv: Granskad OK ✅

source: Reviewed (with comments) 🟠
sv: Granskad (med kommentarer) 🟠

source: Submitted, not reviewed 🟡
sv: Inskickad, inte granskad 🟡

source: Not translated 🔵
sv: Inte översatt 🔵

source: Popcon installs: {n}
sv: Popcon-installationer: {n}

source: {n} untranslated
sv: {n} icke-översatta

source: submitted, awaiting review
sv: inskickad, inväntar granskning

source: reviewed with comments
sv: granskad med kommentarer

source: reviewed OK
sv: granskad OK

source: Editing: {pkg}
sv: Redigerar: {pkg}

source: Translation is empty
sv: Översättningen är tom

source: Sending…
sv: Skickar…

source: Login failed: {e}
sv: Inloggning misslyckades: {e}

source: Validation error: {e}
sv: Valideringsfel: {e}

source: Package locked: {e}
sv: Paketet är låst: {e}

source: Error: {e}
sv: Fel: {e}

source: Source text copied to clipboard
sv: Källtext kopierad till urklipp

source: Translation pasted from clipboard
sv: Översättning inklistrad från urklipp

source: Failed to paste from clipboard
sv: Misslyckades med att klistra in från urklipp

source: po-translate not found
sv: po-translate hittades inte

source: po-translate is not installed. Install it with: pip install po-translate or via your package manager.
sv: po-translate är inte installerat. Installera det med: pip install po-translate eller via din pakethanterare.

source: AI Translation Warning
sv: AI-översättningsvarning

source: po-translate uses AI to generate translations. You MUST carefully review and edit the translation before submitting it for review on DDTSS. Machine translations often contain errors in terminology, grammar, and style.
sv: po-translate använder AI för att generera översättningar. Du MÅSTE noggrant granska och redigera översättningen innan du skickar in den för granskning på DDTSS. Maskinöversättningar innehåller ofta fel i terminologi, grammatik och stil.

source: Cancel
sv: Avbryt

source: Translating with po-translate…
sv: Översätter med po-translate…

source: po-translate failed
sv: po-translate misslyckades

source: Translation timed out
sv: Översättning översteg tidsgräns

source: Auto-translate failed: {e}
sv: Automatisk översättning misslyckades: {e}

source: ⚠️ AI-translated — review carefully before submitting!
sv: ⚠️ AI-översatt — granska noggrant innan du skickar in!

source: Sent successfully!
sv: Inskickad!

source: Translation submitted
sv: Översättning inskickad

source: Package "{pkg}" was submitted successfully and is now pending review on DDTSS.
sv: Paketet ”{pkg}” har skickats in och väntar nu på granskning på DDTSS.

source: Submission failed
sv: Inlämning misslyckades

source: Package "{pkg}" could not be submitted. {err}
sv: Paketet "{pkg}" kunde inte skickas in. {err}

source: Updated {pkg} in queue
sv: Uppdaterade {pkg} i kö

source: Added {pkg} to queue ({n} total)
sv: Lade till {pkg} till kön ({n} totalt)

source: Removed {pkg} from queue
sv: Tog bort {pkg} från kö

source: Send Queue
sv: Sändningskö

source: Sort queue
sv: Sortera kö

source: {n} ready
sv: {n} klara

source: {n} sent ✅
sv: {n} skickade ✅

source: {n} errors
sv: {n} fel

source: Queue is empty
sv: Kön är tom

source: Clear sent ✅
sv: Töm inskickade ✅

source: Clear all
sv: Töm allt

source: Send All ({n})
sv: Skicka alla ({n})

source: Error
sv: Fel

source: Remove from queue
sv: Ta bort från kö

source: Fetching pending reviews…
sv: Hämtar väntande granskningar...

source: Pending review
sv: Väntar på granskning

source: %(time)s — %(count)d pending reviews
sv: %(time)s — %(count)d väntar på granskning

source: Review error: %s
sv: Granskningsfel: %s

source: Error: %s
sv: Fel: %s

source: Accepting %s…
sv: Godkänner %s…

source: Rejecting %s…
sv: Avvisar %s…

source: accepted
sv: godkändes

source: rejected
sv: avvisades

source: Accept All Reviews
sv: Godkänn alla granskningar

source: Accept all %(count)d pending reviews?
sv: Godkänn alla %(count)d väntande granskningar?

source: Session: %(translations)d translations, %(reviews)d reviews
sv: Session: %(translations)d översättningar, %(reviews)d granskningar

source: Loading reviews…
sv: Läser in granskningar…

source: Review Translations
sv: Granska översättningar

source: Accept All ({n})
sv: Godkänn alla ({n})

source: There are no translations waiting for review.
sv: Det finns inga översättningar som väntar på granskning.

source: Pending review ({n})
sv: Väntar på granskning ({n})

source: Reviewed by you ({n})
sv: Granskade av dig ({n})

source: {pending} pending, {reviewed} reviewed by you
sv: {pending} väntar, {reviewed} granskade av dig

source: Accept all {n} reviews?
sv: Godkänn alla {n} granskningar?

source: This will accept all pending translations as-is. This cannot be undone.
sv: Detta kommer att godkänna alla väntande översättningar som de är. Detta kan inte ångras.

source: Accepting {n} reviews…
sv: Godkänner {n} granskningar…

source: Accepted {accepted} reviews, {errors} errors
sv: Godkände {accepted} granskningar, {errors} fel

source: Loading review for {pkg}…
sv: Läser in granskning för {pkg}…

source: Review: {pkg}
sv: Granska: {pkg}

source: Back to list
sv: Tillbaka till listan

source: Previous review (Ctrl+P)
sv: Föregående granskning (Ctrl+P)

source: Next review (Ctrl+N)
sv: Nästa granskning (Ctrl+N)

source: Submitted by: {owner}
sv: Inskickad av: {owner}

source: ⚠️ You cannot review your own translation. Another user must review it.
sv: ⚠️ Du kan inte granska din egen översättning. En annan användare måste granska den.

source: Original short description
sv: Ursprunglig kort beskrivning

source: Translated short description
sv: Översatt kort beskrivning

source: Original long description
sv: Ursprunglig lång beskrivning

source: Translated long description
sv: Översatt lång beskrivning

source: Comment (optional)
sv: Kommentar (valfritt)

source: Log
sv: Logg

source: Submitting review…
sv: Skickar in granskning…

source: Comment only
sv: Kommentera endast

source: Save comment without accepting
sv: Spara kommentar utan att godkänna

source: Accept with changes
sv: Godkänn med ändringar

source: Accept translation with your modifications — restarts review
sv: Godkänn översättningen med dina ändringar — börjar om granskningen

source: Accept as is
sv: Godkänn som den är

source: Accept translation without changes
sv: Godkänn översättning utan ändringar

source: Translation for "{pkg}" accepted.
sv: Översättning för "{pkg}" godkänd.

source: Translation for "{pkg}" accepted with changes (review restarted).
sv: Översättning för "{pkg}" godkänd med ändringar (granskning börjar om).

source: Comment saved for "{pkg}".
sv: Kommentar sparad för "{pkg}".

source: Review submitted
sv: Granskning inskickad

source: Review failed
sv: Granskning misslyckades

source: Could not submit review for "{pkg}". {err}
sv: Kunde inte skicka in granskning för "{pkg}". {err}

source: Fetching statistics…
sv: Hämtar statistik…

source: Failed to fetch statistics: {e}
sv: Misslyckades med att hämta statistik: {e}

source: Language: {lang} ({code}) Active translations: {active} Previously translated: {prev} Total translations (all time): {total} Active packages in Debian: {active_pkgs} Total packages: {total_pkgs} Completion: {pct:.1f}% of active packages
sv: Språk: {lang} ({code}) Aktiva översättningar: {active} Tidigare översatta: {prev} Totalt antal översättningar (samtliga): {total} Aktiva paket i Debian: {active_pkgs} Totalt antal paket: {total_pkgs} Fullbordande: {pct:.1f}% of aktiva paket

source: DDTP Statistics
sv: DDTP-statistik

source: Close
sv: Stäng

source: No package selected
sv: Inget paket valt

source: Translation is empty — nothing to lint
sv: Översättningen är tom — inget att linta

source: l10n-lint not found
sv: l10n-lint hittades inte

source: l10n-lint is not installed. Install it with: pip install l10n-lint Or on Debian/Ubuntu: apt install l10n-lint
sv: l10n-lint är inte installerat. Installera det med: pip install l10n-lint Eller på Debian/Ubuntu: apt install l10n-lint

source: Running l10n-lint…
sv: Kör l10n-lint…

source: Lint error: {e}
sv: Lint-fel: {e}

source: Lint: No issues found ✓
sv: Lint: Inga problem hittades ✓

source: The translation passed all lint checks.
sv: Översättningen klarade alla lint-kontroller.

source: Lint: Passed with notes
sv: Lint: Godkänt med anmärkningar

source: Lint: Issues found
sv: Lint: Problem hittades

source: l10n-lint reported errors (exit code {c}).
sv: l10n-lint rapporterade fel (avslutningskod {c}).

source: Submit {n} translations via DDTSS?
sv: Skicka in {n} översättningar via DDTSS?

source: You are about to submit {n} translation(s) to the DDTSS web interface. • Translations are submitted directly via HTTP — no delay needed • Successfully submitted packages are marked with ✅ • You can cancel the process at any time • Any errors will be shown per package
sv: Du är på väg att skicka {n} översättning(ar) till DDTSS-webbgränssnittet. • Översättningar skickas direkt via HTTP – ingen fördröjning behövs • Paket som skickats framgångsrikt markeras med ✅ • Du kan avbryta processen när som helst • Eventuella fel visas per paket

source: Submit All
sv: Skicka in alla

source: Sending Translations
sv: Skickar översättningar

source: Sending translations…
sv: Skickar översättningar…

source: ⏸ Cancelling…
sv: ⏸ Avbryter…

source: ❌ Cancelled by user. {sent}/{total} sent.
sv: ❌ Avbröts av användaren. {sent}/{total} skickade.

source: Sending: {pkg} ({i}/{total})
sv: Skickar: {pkg} ({i}/{total})

source: Done! {sent} sent, {errors} errors out of {total}
sv: Färdig! {sent} skickade, {errors} fel av totalt {total}

source: All {n} translations submitted
sv: Alla {n} översättningar inskickade

source: All {n} submissions failed
sv: Alla {n} inlämningar misslyckades

source: {sent} sent, {errors} failed
sv: {sent} skickade, {errors} misslyckades

source: {n} translation(s) in queue not yet submitted
sv: {n} översättning(ar) i kö ännu inte inskickade

source: {n} translation(s) modified but not added to queue
sv: {n} översättning(ar) ändrade men ligger inte i kön

source: Quit DDTP Translate?
sv: Avsluta Översätt DDTP?

source: You have unsaved work: • {items} This will be lost if you quit.
sv: Du har osparat arbete: • {items} Detta går förlorat om du avslutar.

source: Quit anyway
sv: Avsluta ändå

source: No packages loaded to export
sv: Inga paket lästes in att exportera

source: Export PO — Filter
sv: Exportera PO — Filter

source: Filter Options
sv: Filteralternativ

source: Narrow down which packages to export.
sv: Begränsa vilka paket som ska exporteras.

source: Max number of packages (0 = all)
sv: Maximalt antal paket (0 = alla)

source: Starting letter
sv: Första bokstaven

source: Matching: {x} of {y} packages
sv: Matchar: {x} av {y} paket

source: Export
sv: Exportera

source: PO files
sv: PO-filer

source: Exported {n} packages to {path}
sv: Exporterade {n} paket till {path}

source: No translated entries found in file (only entries with translations are imported)
sv: Inga översatta poster hittades i filen (endast poster med översättningar importeras)

source: Import Review — {n} translations
sv: Importera granskning — {n} översättningar

source: Select a translation to preview
sv: Välj en översättning att förhandsgranska

source: Checking…
sv: Kontrollerar…

source: l10n-lint not installed — skipping lint checks
sv: l10n-lint är inte installerat — hoppar över lint-kontroller

source: Add Selected to Queue
sv: Lägg till markerade i kö

source: Add All to Queue
sv: Lägg till alla i kö

source: Lint issues ⚠️
sv: Lint-problem ⚠️

source: Imported {added} new, {updated} updated — {total} in queue
sv: Importerade {added} nya, {updated} uppdaterade — {total} i kö

source: Welcome to DDTP Translate
sv: Välkommen till Översätt DDTP

source: This app helps you translate Debian package descriptions through the Debian Description Translation Project (DDTP). DDTSS (Debian Description Translation Server) is a web-based system where volunteers translate the short and long descriptions of all Debian packages. Translations are peer-reviewed before inclusion. How it works: 1. Create a free account at ddtp.debian.org 2. Select your language and browse untranslated packages 3. Write your translation in the editor 4. Submit — your translation enters the review queue 5. Other translators review and approve To get started, you need a DDTSS account. Click "Register" below to create one, or "Get Started" if you already have an account.
sv: Denna app hjälper dig att översätta Debian-paketbeskrivningar genom Debian Description Translation Project (DDTP). DDTSS (Debian Description Translation Server) är ett webbaserat system där volontärer översätter korta och långa beskrivningar av alla Debian-paket. Översättningarna granskas av kollegor innan de inkluderas. Så här fungerar det: 1. Skapa ett gratis konto på ddtp.debian.org 2. Välj ditt språk och bläddra bland oöversatta paket 3. Skriv din översättning i redigeraren 4. Skicka in – din översättning hamnar i granskningskön 5. Andra översättare granskar och godkänner För att komma igång behöver du ett DDTSS-konto. Klicka på ”Registrera” nedan för att skapa ett, eller ”Kom igång” om du redan har ett konto.

source: Get Started
sv: Kom igång

source: Register
sv: Registrera

source: Login Required
sv: Inloggnings krävs

source: You need a DDTSS account to submit translations. If you already have an account, click "Log In" to enter your credentials. Otherwise, click "Register" to create a free account at ddtp.debian.org.
sv: Du behöver ett DDTSS-konto för att skicka in översättningar. Om du redan har ett konto, klicka på ”Logga in” för att ange dina inloggningsuppgifter. Annars klickar du på ”Registrera” för att skapa ett gratis konto på ddtp.debian.org.

source: Log In
sv: Logga in

source: DDTSS Login
sv: DDTSS-inloggning

source: Enter your DDTSS credentials
sv: Ange dina DDTSS-uppgifter

source: Log In & Submit
sv: Logga in och skicka in

source: Credentials saved
sv: Inloggningsuppgifter sparades

source: Translate this app: https://www.transifex.com/danielnylander/ddtp-translate/
sv: Översätt denna app: https://www.transifex.com/danielnylander/ddtp-translate/

source: Translate Debian package descriptions via DDTP
sv: Översätt Debian-paketbeskrivningar via DDTP

source: Shortcuts
sv: Genvägar

source: Submit current translation
sv: Skicka in aktuell översättning

source: Add to queue
sv: Lägg till i kö

source: Refresh packages
sv: Uppdatera paket

source: Navigation
sv: Navigering

source: Next package
sv: Nästa paket

source: Previous package
sv: Föregående paket

source: Focus search
sv: Fokusera sökning

source: Application
sv: Applikation

source: Quit
sv: Avsluta

source: Keyboard shortcuts
sv: Tangentbordsgenvägar
